[
  {
    "id": "nm001",
    "title": "Welcome to Islam - A Beginner's Guide",
    "category": "Getting Started",
    "readTime": "10 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Everything you need to know as you begin your journey in Islam.",
    "featureImage": "https://images.unsplash.com/photo-1591604129939-f1efa4d9f7fa?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "Welcome to Islam! This comprehensive guide will help you navigate your first steps as a new Muslim. We'll cover the basics of faith, prayer, and building a strong Islamic foundation. This article covers the fundamental beliefs of Islam, including the Six Articles of Faith and the Five Pillars of Islam. You'll learn about the importance of prayer, charity, fasting, and pilgrimage in Islamic practice. We also discuss how to integrate these practices into your daily life and find balance as a new Muslim. The journey of faith is personal and unique for everyone, but having proper guidance makes the path clearer and more meaningful.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  },
  {
    "id": "nm002",
    "title": "The Beautiful Names of Allah",
    "category": "Faith",
    "readTime": "8 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Learn about the 99 beautiful names of Allah and their meanings.",
    "featureImage": "https://images.unsplash.com/photo-1609599006353-e629aaabfeae?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "Understanding Allah's beautiful names (Asma ul-Husna) helps deepen your connection with your Creator. This article explores some of the most commonly known names and their significance in daily life. We discuss names like Ar-Rahman (The Most Merciful), Ar-Raheem (The Most Compassionate), Al-Ghafoor (The Oft-Forgiving), and many others. Each name reflects a divine attribute that can guide us in our worship and daily conduct. Learning these names helps in developing a deeper understanding of Allah's nature and strengthens our relationship with Him through prayer and remembrance.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  },
  {
    "id": "nm003",
    "title": "Building Your Daily Routine as a Muslim",
    "category": "Lifestyle",
    "readTime": "6 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Practical tips for incorporating Islamic practices into your daily life.",
    "featureImage": "https://images.unsplash.com/photo-1585036156171-384164a8c675?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "Creating a balanced daily routine that includes prayer, remembrance of Allah, and beneficial activities is key to living as a practicing Muslim. This guide provides practical advice on structuring your day around the five daily prayers, incorporating dhikr (remembrance of Allah), reading the Quran, and maintaining good Islamic etiquette in all aspects of life. We also discuss how to balance religious obligations with work, family, and social responsibilities in modern society.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  },
  {
    "id": "nm004",
    "title": "Finding Muslim Community in Vietnam",
    "category": "Community",
    "readTime": "5 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Connect with local Muslim communities and find support in Vietnam.",
    "featureImage": "https://images.unsplash.com/photo-1580418827493-f2b22c0a76cb?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "Building connections with fellow Muslims is important for spiritual growth. Learn about mosques, Islamic centers, and community groups in Vietnam. This article provides information about the Muslim community in Vietnam, including major mosques in Ho Chi Minh City and Hanoi, community organizations, and ways to connect with other Muslims. We also discuss the importance of finding mentorship and support from experienced Muslims who can guide you in your faith journey.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  },
  {
    "id": "nm005",
    "title": "Understanding Prayer (Salah) - A Step by Step Guide",
    "category": "Worship",
    "readTime": "12 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Complete guide to performing the five daily prayers.",
    "featureImage": "https://images.unsplash.com/photo-1578662996442-48f60103fc96?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "Prayer is one of the five pillars of Islam. This comprehensive guide will teach you how to perform each prayer correctly with proper etiquette and understanding. We cover the prerequisites for prayer including ablution (wudu), the direction of prayer (qibla), and appropriate clothing. The guide then walks through each of the five daily prayers - Fajr, Dhuhr, Asr, Maghrib, and Isha - with detailed instructions on the movements, recitations, and timing. Special attention is given to common mistakes new Muslims make and how to avoid them.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  },
  {
    "id": "nm006",
    "title": "Learning to Read Arabic and Quran",
    "category": "Education",
    "readTime": "15 min",
    "publishedDate": "February 2, 2026",
    "excerpt": "Beginner's guide to learning Arabic letters and reading the Quran.",
    "featureImage": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?ixlib=rb-4.0.3&auto=format&fit=crop&w=2070&q=80",
    "content": "While not mandatory, learning to read Arabic enhances your connection with the Quran. This article provides resources and methods for beginners to start learning Arabic script and eventually read the Quran in its original language. We cover the Arabic alphabet, basic pronunciation rules, and recommended learning resources including apps, books, and online courses. The guide also explains the difference between Classical Arabic and Modern Standard Arabic, and why learning to read the Quran is spiritually beneficial.",
    "author": "Islamic Resources Team",
    "language": "en",
    "pdfUrls": [],
    "audioUrls": [],
    "videoUrls": [],
    "docUrls": []
  }
]